import { ref } from 'vue';

const Types = ref({
    'type_1': 'Тип 1 Спонтанный ИМ, вызванный разрывом или эрозией АСБ',
    'type_2': 'Тип 2 Вторичный ИМ, связанный со снижением поступления кислорода',
    'type_3': 'Тип 3 Внезапная коронарная смерть',
    'type_4a': 'Тип 4а ИМ, связанный с ЧКВ',
    'type_4b': 'Тип 4б ИМ, связанный с тромбозом стента после ЧКВ',
    'type_4c': 'Тип 4с ИМ, связанный с рестенозом после ЧКВ',
    'type_5': 'Тип 5 ИМ, связанный с аортокоронарным шунтированием'
});

export default Types;
